[Pillar X2AbilityTemplate]
LocFriendlyName="Pillar"
LocLongDescription="Summon a pillar of Psionic energy to act as a high cover point. Costs 1 Focus."
LocHelpText="Summon high cover at a target location. Costs 1 Focus."
LocPromotionPopupText="<Bullet/> The pillar will last for a number of turns equal to the Templar's Focus level when summoned.<br/><Bullet/> Pillar is a free action, and can be used during Momentum.<br/>"

[StunStrike X2AbilityTemplate]
LocFriendlyName="Stun Strike"
LocLongDescription="Strike an enemy with Psionic force strong enough to knock them back in the direction of the attack, stunning them. Costs 1 Focus."
LocHelpText="Knock an enemy back in the direction of the attack, stunning them. Costs 1 Focus."
LocPromotionPopupText="<Bullet/> Stun Strike has a <Ability:STUNSTRIKEHITCHANCE/>% chance to hit, increased by <Ability:STUNSTRIKEFOCUSHITCHANCE/>% for each Focus level.<br/><Bullet/> Stun Strike has a <Ability:STUNSTRIKE_STUN_CHANCE/>% chance to stun the target if successful.<br/><Bullet/> Stun Strike does not end the Templar's turn, but has a <Ability:SelfCooldown/> turn cooldown.<br/>"